[
  {
    "title": "OpenAI-Powered Documentation Quality Feedback System",
    "excerpt": "Developed an end-to-end solution using the OpenAI API to ingest de-identified patient notes and generate actionable feedback—ensuring technicians and providers produce documentation that meets Blue Cross Blue Shield audit standards.",
    "url": "/projects/LLM-note-coaching"
  },
  {
    "title": "Microsoft Fabric Reporting & Compliance Intelligence System",
    "excerpt": "Architected a robust Microsoft Fabric solution combining Power BI, SQL-based pipelines, and NLP-driven compliance checks to transform documentation quality and operational visibility in healthcare.",
    "url": "/projects/Microsoft-Fabric"
  },
  {
    "title": "ADP Workforce Now Implementation",
    "excerpt": "Implemented ADP Workforce Now…",
    "url": "/projects/adp-workforcenow"
  },
  {
    "title": "AdvancedMD Implementation",
    "excerpt": "Transitioned from paper records to a unified digital EHR system, integrating ABA, PT, OT, ST, and medical appointments with electronic billing.",
    "url": "/projects/advancedmd-implementation"
  },
  {
    "title": "Bank Projections and Financial Modeling",
    "excerpt": "Developed detailed financial models and projections to secure a $10M loan for a 36,000 sq. ft facility.",
    "url": "/projects/bank-projections-modeling"
  },
  {
    "title": "Enterprise Digital Transformation",
    "excerpt": "Transitioned from paper-based workflows to cloud-based SaaS solutions, saving over $250K+ annually.",
    "url": "/projects/enterprise-digital-transformation"
  },
  {
    "title": "FermentApp: Fermentation Tracking & Task Scheduler",
    "excerpt": "Designed and developed FermentApp, an iOS application to track fermentation processes, schedule essential tasks, and visualize historical data for optimal batch outcomes.",
    "url": "/projects/ferment-app"
  },
  {
    "title": "Sage Intacct Integration with Square POS",
    "excerpt": "Implemented Sage Intacct and integrated it with Square POS through Shogo, building custom reports for seamless accounting reconciliation.",
    "url": "/projects/sage-intacct-integration-with-square-pos"
  }
]